In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]
for schools in high_schools:
    print(schools)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [29]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

#for i in range(len(high_school_types)):
    #for key in high_shcool_types[i]:
        #print(high_school_types[i][key])

for dict in high_school_types:
    print(dict)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [24]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
print(high_school_types)

[{'High School': 'Griffin', 'Type': 'District'}, {'High School': 'Figueroa', 'Type': 'District'}, {'High School': 'Wilson', 'Type': 'Charter'}, {'High School': 'Wright', 'Type': 'Charter'}]

In [30]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [31]:
# Add the pandas dependency
import pandas as pd

In [37]:
# Create a pandas series from a list
school_series = pd.Series(high_schools)
for schools in school_series:
    print(schools)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [38]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [39]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [41]:
# Initialize a new DataFrame
schools_df = pd.DataFrame()
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Add the list to a new DataFrame.
schools_df["school_name"] = school_name

# Add the list to a new DataFrame.
schools_df["type"] = type_of_school


# Print the DataFrame.
schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [49]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}
 
high_schools_df = pd.DataFrame(high_schools_dict)
high_schools_df.columns
high_schools_df.index
high_schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [50]:
schools_df["school_name"].head()

0        Huang High School
1     Figueroa High School
2      Shelton High School
3    Hernandez High School
4      Griffin High School
Name: school_name, dtype: object

In [51]:
# get summary stats
schools_df["school_name"].describe()

count                        5
unique                       5
top       Figueroa High School
freq                         1
Name: school_name, dtype: object

In [54]:
schools_df["type"].value_counts()

District    3
Charter     2
Name: type, dtype: int64

In [55]:
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [60]:
school_df_exp = school_df
school_df_exp
school_df_exp.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [62]:
school_df_exp = school_df_exp.drop(school_df_exp.columns[2],axis=1)
school_df_exp

   School ID            school_name
0          0   Huang High    School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [65]:
school_df.loc[[2],['type']] = "Public"
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School    Public
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

### Binning Practice

In [101]:
import numpy as np

x = np.random.randint(1,16,10)
x_df = pd.DataFrame({"nums":x})
x_df

   nums
0    10
1     5
2    14
3     4
4     2
5     8
6     5
7    11
8     9
9    14

In [103]:
bins = [0,4,8,16]
group_names = ['a','b','c']
x_df["bins"] = pd.cut(x_df["nums"],bins,labels = group_names)

   nums bins
0    10    c
1     5    b
2    14    c
3     4    a
4     2    a
5     8    b
6     5    b
7    11    c
8     9    c
9    14    c

In [106]:
x_df.groupby(x_df["bins"]).count()

      nums
bins
a        2
b        3
c        5